In [20]:
import pandas as pd
import matplotlib as plt

Using matplotlib backend: Qt5Agg

In [2]:
df = pd.read_csv("sp500_stock_data.csv")

In [3]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-05-02,1885.300049,1891.329956,1878.500000,1881.140015,1881.140015,3159560000
1,2014-05-05,1879.449951,1885.510010,1866.770020,1884.660034,1884.660034,2733730000
2,2014-05-06,1883.689941,1883.689941,1867.719971,1867.719971,1867.719971,3327260000
3,2014-05-07,1868.530029,1878.829956,1859.790039,1878.209961,1878.209961,3632950000
4,2014-05-08,1877.390015,1889.069946,1870.050049,1875.630005,1875.630005,3393420000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 7 columns):
Date         1258 non-null object
Open         1258 non-null float64
High         1258 non-null float64
Low          1258 non-null float64
Close        1258 non-null float64
Adj Close    1258 non-null float64
Volume       1258 non-null int64
dtypes: float64(5), int64(1), object(1)
memory usage: 68.9+ KB

In [5]:
df_d = df.drop(columns=["Open","High","Low","Adj Close", "Volume"])
df_d.head()

         Date        Close
0  2014-05-02  1881.140015
1  2014-05-05  1884.660034
2  2014-05-06  1867.719971
3  2014-05-07  1878.209961
4  2014-05-08  1875.630005

In [6]:
df_d.set_index(df["Date"], inplace=True)

In [7]:
df_d.head()

                  Date        Close
Date
2014-05-02  2014-05-02  1881.140015
2014-05-05  2014-05-05  1884.660034
2014-05-06  2014-05-06  1867.719971
2014-05-07  2014-05-07  1878.209961
2014-05-08  2014-05-08  1875.630005

In [8]:
df_d.drop(columns=["Date"], inplace = True)
df_d.head()

                  Close
Date
2014-05-02  1881.140015
2014-05-05  1884.660034
2014-05-06  1867.719971
2014-05-07  1878.209961
2014-05-08  1875.630005

In [ ]:
df_d.plot()
plt.show()

In [ ]:
df_d.shift(1).head()

In [11]:
df_d.shift(-1).head()

                  Close
Date
2014-05-02  1884.660034
2014-05-05  1867.719971
2014-05-06  1878.209961
2014-05-07  1875.630005
2014-05-08  1878.479980

In [12]:
df_return = (df_d - df_d.shift(1))/(df_d.shift(1))
df_return.head()

               Close
Date
2014-05-02       NaN
2014-05-05  0.001871
2014-05-06 -0.008988
2014-05-07  0.005616
2014-05-08 -0.001374

In [13]:
df_return_2 = df_d.pct_change()
df_return_2.head()

               Close
Date
2014-05-02       NaN
2014-05-05  0.001871
2014-05-06 -0.008988
2014-05-07  0.005616
2014-05-08 -0.001374

In [17]:
c_return = (1+df_return_2).cumprod()
c_return.head()

               Close
Date
2014-05-02       NaN
2014-05-05  1.001871
2014-05-06  0.992866
2014-05-07  0.998442
2014-05-08  0.997071

In [ ]:
c_return.plot()